In [1]:
import pandas as pd
import numpy as np

## Create DataFrame

In [2]:
x = {'a':[1,2,np.nan], 'b':[5,np.nan,np.nan],'c':[2,3,5]}

In [3]:
df = pd.DataFrame(x)

In [4]:
df

     a    b  c
0  1.0  5.0  2
1  2.0  NaN  3
2  NaN  NaN  5

## Drop Missing Values from DataFrame

#### Drop all rows with a missing value. By default axis=0, all rows are dropped

In [46]:
df.dropna()

     a    b  c
0  1.0  5.0  2

#### Drop all rows with a missing value. By default axis=1, all columns are dropped

In [47]:
df.dropna(axis=1)

   c
0  2
1  3
2  5

#### Drop rows in the b column that are NaN

In [6]:
df.dropna(subset=['b'])

     a    b  c
0  1.0  5.0  2

In [7]:
df.dropna(subset=['a'])

     a    b  c
0  1.0  5.0  2
1  2.0  NaN  3

#### Set threshold to drop based on number of non missing values

In [48]:
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  2
1  2.0  NaN  3

## Fill in Missing Values

#### Fill in all missing values with string

In [49]:
df.fillna(value='test')

      a     b  c
0     1     5  2
1     2  test  3
2  test  test  5

#### Fill in missing values with numeric (mean of a)

In [41]:
df['a'].fillna(value=df.a.mean(), inplace=True)

In [42]:
df

     a    b  c
0  1.0  5.0  2
1  2.0  NaN  3
2  1.5  NaN  5